tools/fuzz/mutants/patches/allow_with_alias_return.patch
diff --git a/src/annotator/domains/errors.rb b/src/annotator/domains/errors.rb
--- a/src/annotator/domains/errors.rb
+++ b/src/annotator/domains/errors.rb
@@ -411,7 +411,7 @@
         # SymbolEntry#non_escaping flag is set on every WITH alias by
         # declare_capability_scope!; it's the same flag ensure_owned_value!
         # already uses to prevent storing WITH-scoped values in containers.
-        if inside_with_block?
+        if false && inside_with_block?
           if value.is_a?(AST::Identifier) && value.symbol&.non_escaping
             error!(node, :RETURN_FROM_WITH_SCOPED,
               name: value.name)
