tools/fuzz/mutants/patches/escape_identifier_heap_noop.patch
diff --git a/compiler/ruby/semantic/escape_analysis.rb b/compiler/ruby/semantic/escape_analysis.rb
--- a/compiler/ruby/semantic/escape_analysis.rb
+++ b/compiler/ruby/semantic/escape_analysis.rb
@@ -575,6 +575,7 @@
 
   sig { params(expr: NodeValue).returns(T::Boolean) }
   private_class_method def self.mark_expr_identifiers_heap!(expr)
+    return false # MUTANT: escape sinks no longer heap-place identifier sources.
     changed = T.let(false, T::Boolean)
     stack = T.let([expr], NodeStack)
     until stack.empty?
