tools/fuzz/mutants/patches/escape_identifier_heap_noop.patch
diff --git a/compiler/ruby/semantic/escape_analysis.rb b/compiler/ruby/semantic/escape_analysis.rb
--- a/compiler/ruby/semantic/escape_analysis.rb
+++ b/compiler/ruby/semantic/escape_analysis.rb
@@ -400,6 +400,7 @@
 
   sig { params(node: AST::ReturnNode, context: EscapeContext).void }
   private_class_method def self.apply_return_escape_sink!(node, context)
+    return # MUTANT: returned owned values no longer receive escape placement.
     value = node.value
     return unless value
     return unless owning_return_needs_heap_placement?(context.fn, value, context.schema_lookup)
