tools/fuzz/mutants/patches/local_frame_decls_stdlib_provenance.patch
diff --git a/src/mir/control_flow.rb b/src/mir/control_flow.rb
index 553432423..107097cc1 100644
--- a/src/mir/control_flow.rb
+++ b/src/mir/control_flow.rb
@@ -1387,7 +1387,7 @@ module LoopFrameAnalysis
   def self.frame_local_collection?(ti)
     return false unless ti
     collection_shaped = ti.list_collection? || ti.map? || ti.array? || ti.string?
-    collection_shaped && !ti.heap? && !ti.rodata?
+    collection_shaped && ti.frame?  # MUTANT: revert to the never-stamped frame? check
   end
 
   sig { params(body: T::Array[T.untyped], _local_names: T::Set[String]).returns(T::Array[T.untyped]) }
