tools/fuzz/mutants/patches/local_frame_decls_stdlib_provenance.patch
diff --git a/compiler/ruby/mir/lowering/control_flow.rb b/compiler/ruby/mir/lowering/control_flow.rb
--- a/compiler/ruby/mir/lowering/control_flow.rb
+++ b/compiler/ruby/mir/lowering/control_flow.rb
@@ -246,5 +246,5 @@ module MIRLoweringControlFlow
 
   sig { params(stmts: T::Array[MIR::Node], mark_per_iter: T.nilable(T::Boolean)).void }
   def finalize_loop_frame_alloc_scopes!(stmts, mark_per_iter)
-    stamp_loop_frame_alloc_scopes!(stmts, mark_per_iter == true ? :iteration : :function)
+    stamp_loop_frame_alloc_scopes!(stmts, :function) # MUTANT: loop-local frame allocations lose per-iteration scope.
   end
