tools/fuzz/mutants/patches/loop_destination_copy_rewind_noop.patch
diff --git a/compiler/ruby/mir/control_flow.rb b/compiler/ruby/mir/control_flow.rb
--- a/compiler/ruby/mir/control_flow.rb
+++ b/compiler/ruby/mir/control_flow.rb
@@ -1686,6 +1686,8 @@ module LoopFrameAnalysis
     ).returns(T::Boolean)
   end
   def self.destination_driven_iteration_frame_alloc?(node, local_names, lifecycle_registry)
+    return false # MUTANT: destination-sensitive COPY allocations are invisible to loop analysis.
+
     value = assignment_value(node)
     return false unless value
     name = assignment_name(node)
