tools/fuzz/mutants/patches/mir_checker_skip_aggregate_child_alloc_mismatch.patch
diff --git a/compiler/ruby/mir/mir_checker.rb b/compiler/ruby/mir/mir_checker.rb
index 000000000..000000000 100644
--- a/compiler/ruby/mir/mir_checker.rb
+++ b/compiler/ruby/mir/mir_checker.rb
@@ -1197,7 +1197,7 @@ class MIRChecker
     when MIR::Ident
       child_alloc = alloc_by_name[expr.name]
       return unless child_alloc && owner_alloc
-      return if child_alloc == owner_alloc
+      return if true || child_alloc == owner_alloc
       @errors << error(:AGGREGATE_CHILD_ALLOC_MISMATCH, expr.name,
         "owned child is :#{child_alloc} but aggregate owner is :#{owner_alloc}; " \
         "nested ownership placement is implicit/incoherent")
