tools/fuzz/mutants/patches/mir_checker_skip_call_contracts.patch
diff --git a/compiler/ruby/mir/mir_checker.rb b/compiler/ruby/mir/mir_checker.rb
index 000000000..000000000 100644
--- a/compiler/ruby/mir/mir_checker.rb
+++ b/compiler/ruby/mir/mir_checker.rb
@@ -439,6 +439,5 @@ class MIRChecker
     verify_cleanup_required_finalizers!(allocs, cleanups, errdefer_destroy_names, transfers)
     verify_ownership_consumption_operands!(structural_ownership_nodes)
-    verify_call_contracts!(nodes, transfers, allocs)
     verify_structural_ownership_contracts!(structural_ownership_nodes, transfers, allocs)
     verify_explicit_ownership_contracts!(nodes, transfers, allocs)
     verify_ownership_surfaces_finalized!(nodes, ownership_fact_nodes)
