tools/fuzz/mutants/patches/mir_checker_skip_cleanup_source_owns.patch
diff --git a/compiler/ruby/mir/mir_checker.rb b/compiler/ruby/mir/mir_checker.rb
index 000000000..000000000 100644
--- a/compiler/ruby/mir/mir_checker.rb
+++ b/compiler/ruby/mir/mir_checker.rb
@@ -1340,6 +1340,7 @@ class MIRChecker
 
   sig { params(node: MIR::Let, cleanup: T.any(MIR::Cleanup, MIR::ErrCleanup)).returns(T::Boolean) }
   def cleanup_source_owns_value?(node, cleanup)
+    return true
     init = ownership_source_expr(node.init)
     return true if cleanup.cleanup_entry.match_as?
     return true if allocating_expr?(init)
