tools/fuzz/mutants/patches/union_match_drops_payload_capture.patch
diff --git a/compiler/ruby/backends/mir_emitter.rb b/compiler/ruby/backends/mir_emitter.rb
index 000000000..000000000 100644
--- a/compiler/ruby/backends/mir_emitter.rb
+++ b/compiler/ruby/backends/mir_emitter.rb
@@ -2200,10 +2200,10 @@ class MIREmitter
   def emit_union_match(node)
     subject = emit(node.subject)
     arms = node.arms.map do |arm|
       body = emit_body(arm.body)
       payload = arm.payload
-      capture = payload ? " |#{payload}|" : ""
+      capture = ""
       suppress = payload ? "_ = &#{payload};\n" : ""
       ".#{arm.variant} =>#{capture} {\n#{suppress}#{body}\n}"
     end
     if (default_body = node.default_body)
